app/controllers/retweets_controller.rb

  def new
    @retweet = Retweet.new(tweet_id: params[:id].to_i, user_id: current_user.id)
    @retweet.save
---
INSERT INTO "retweets" ("tweet_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweet_id", 1], ["user_id", 1], ["created_at", "2020-12-18 16:51:51.923717"], ["updated_at", "2020-12-18 16:51:51.923717"]]

    def set_retweet
      @retweet = Retweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]