app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC
---
  def index
    @tweets = Tweet.all.order(created_at: :DESC)

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC
---
  def edit
    @tweets = Tweet.all.order(created_at: :DESC)

INSERT INTO "tweets" ("tweeet", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweeet", "First tweet"], ["user_id", 1], ["created_at", "2020-12-18 16:27:58.158160"], ["updated_at", "2020-12-18 16:27:58.158160"]]
---
  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save

UPDATE "tweets" SET "tweeet" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["tweeet", ""], ["updated_at", "2020-12-18 16:28:27.366443"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)